ubuntu-nvidia-driver.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-09-17 日 17:45 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Install Nvidia Driver On Ubuntu22.04 (Lenovo)</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="Handle SGX, Secure Boot" />
<meta name="keywords" content="nvidia, lenovo, ubuntu, sgx, mok" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bulma@0.9.4/css/bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><a href='https://github.com/ChanMo/blog/issues' target='_blank' class='navbar-item'>Comment</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Install Nvidia Driver On Ubuntu22.04 (Lenovo)</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9a31448">1. Enable SGX</a></li>
<li><a href="#org518f428">2. Install Nvidia Driver</a></li>
<li><a href="#org79383a9">3. First Reboot</a></li>
<li><a href="#orgbc33f91">4. Check Driver</a></li>
<li><a href="#org490b85a">5. References</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org9a31448" class="outline-2">
<h2 id="org9a31448"><span class="section-number-2">1.</span> Enable SGX</h2>
<div class="outline-text-2" id="text-1">
<p>
In BIOS, set SGX to Enabled.
</p>
</div>
</div>

<div id="outline-container-org518f428" class="outline-2">
<h2 id="org518f428"><span class="section-number-2">2.</span> Install Nvidia Driver</h2>
<div class="outline-text-2" id="text-2">
<p>
Remove Nvidia Packages
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get remove --purge nvidia-*
sudo apt-get remove --purge '^libnvidia-.*'
sudo apt-get remove --purge '^cuda-.*'
</pre>
</div>

<p>
Find Drivers
</p>
<div class="org-src-container">
<pre class="src src-bash">ubuntu-drivers devices
</pre>
</div>

<p>
DO NOT CHOOSE `nvidia-driver-*-open`
</p>

<p>
Install
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get install nvidia-driver-525
</pre>
</div>

<p>
If there is a dialog about "secure boot", remember your password
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo reboot
</pre>
</div>
</div>
</div>

<div id="outline-container-org79383a9" class="outline-2">
<h2 id="org79383a9"><span class="section-number-2">3.</span> First Reboot</h2>
<div class="outline-text-2" id="text-3">
<p>
Select "Perform MOK Management",
Select "Enroll MOK",
Input your password,
Select "Ok"
</p>
</div>
</div>

<div id="outline-container-orgbc33f91" class="outline-2">
<h2 id="orgbc33f91"><span class="section-number-2">4.</span> Check Driver</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-bash">nvidia-smi
</pre>
</div>
</div>
</div>


<div id="outline-container-org490b85a" class="outline-2">
<h2 id="org490b85a"><span class="section-number-2">5.</span> References</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://gist.github.com/bitsurgeon/b0f4440984c9e60dcd8fe8bbc346c029">https://gist.github.com/bitsurgeon/b0f4440984c9e60dcd8fe8bbc346c029</a></li>
<li><a href="https://www.linuxcapable.com/install-nvidia-drivers-on-ubuntu-linux/">https://www.linuxcapable.com/install-nvidia-drivers-on-ubuntu-linux/</a></li>
</ul>

<div id="comments"></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>